<template>
  <!-- 产业招商home -->
  <LeftRight>
    <template #left>
      <Allcom :_Info="leftInfo" />
    </template>
    <template #center> </template>
    <template #right>
      <Allcom :_Info="rightInfo" />
    </template>
  </LeftRight>
</template>

<script>
import * as echarts from "echarts";
export default {
  name: "homePage",
  data() {
    return {
      // 左侧组件info
      leftInfo: [
        {
          title: "房屋租售情况",
          type: "pieChart2",
          datas: {
            eHeight: null,
            padding: null,
            optionName: ["已售", "已租", "开放"],
            datas: [63.2, 21.5, 15.3],
            keyD: {
              value: 2483,
              name: "房源合计(套)",
            },
          },
        },
        {
          title: "优惠政策",
          type: "favorablePolicy",
          datas: {
            padding: null,
            favorablePolicyDatas: [
              {
                src: require("@/assets/img/datas/zc_lh.png"),
                title: "落户奖励政策",
                content: "对国家评审认定的科技产业园区和建筑产业园区平台,...",
              },
              {
                src: require("@/assets/img/datas/zc_fybt.png"),
                title: "费用补贴扶持",
                content: "引入世界500强、全国100强，细分行业20强和上市",
              },
              {
                src: require("@/assets/img/datas/zc_zctz.png"),
                title: "资产投资奖励",
                content: "引入上述企业二级集团公司，三级公司的分别给予...",
              },
              {
                src: require("@/assets/img/datas/zc_rcfc.png"),
                title: "人才扶持政策",
                content: "行业年会长期落户我区的，对主办方单位分别给予...",
              },
            ],
          },
        },
        {
          title: "前沿动态",
          type: "currentTrends",
          datas: {
            padding: null,
            currentTrendsDatas: [
              {
                title: "国家产业",
                content: "工信部：积极考虑集成电路纳入“十四五”国家专项规划",
              },
              {
                title: "园区招商",
                content: "庆贺星巴克等6家企业即将入驻园区",
              },
              {
                title: "产业新闻",
                content: "恭喜奇信股份连续8年荣获国家鲁班奖",
              },
            ],
          },
        },
      ],
      rightInfo: [
        {
          title: "聚焦产业",
          type: "FocusIndustry",
          datas: {
            eHeight: null,
            padding: null,
            keyD: {
              name: "企业合计(家)",
              value: 2483,
            },
            optionName: [
              "商家",
              "信息技术",
              "智能制造",
              "新材料",
              "新能源",
              "文化创意",
              "现代服务",
              "节能环保",
              "生物医药",
            ],
            datas: [32.05, 19.23, 12.82, 9.62, 6.41, 8.33, 5.13, 3.2, 3.21],
          },
        },
        {
          title: "企业列表",
          type: "companiesList",
          datas: {
            selectedNum: 1,
            selectedNum2: 0,
            buldingList: [
              {
                bulding: "1期",
                id: 1,
                nums: [
                  {
                    name: "A座",
                    buildings: [
                      {
                        name: "万劲科技",
                        comType: "批发和零售业",
                        inDate: "2021年1月23日",
                        comInfo:
                          "深圳市万劲科技有限公司，于2012-04-06在中国 广东 深圳注册成立，属于批发和零售业，主营行业为批发和零售业，我公司以生产加工的模式经营，加工方式为来料加工,OEM加工,来样加工,ODM加工,来料代工加工,来图加工,其他,手工加工，加工工艺为其他照明加工工艺，服务领域为电子; 通信; 礼品工艺品; 纺织皮革; 玩具; 数码家电; 其它，员工人数101 - 200 人，注册资本50万元。深圳市万劲科技有限公司办公地址为深圳市宝安区沙井街道西环路沙一新村82号2楼201（办公场所），如果您对我们的产品、技术或服务有兴趣，随时欢迎您的来电或上门咨询。",
                        src: require("@/assets/img/datas/qy_wjkj.png"),
                      },
                      {
                        name: "鹄跃电子",
                        comType: "制造业",
                        inDate: "2021年2月34日",
                        comInfo:
                          "鹄跃电子科技（深圳）有限公司是专门从事工业自动化控制产品的研发、生产和销售的高新技术企业，主要产品包括20V~60V低压交流伺服、220V交流伺服以及配套的永磁同步电机等。服务的行业涵盖了装备制造业、节能环保、新能源三大领域，产品广泛应用于物流、机床、电线、电缆、塑胶、印刷包装、纺织化纤、建材、冶金、煤矿、市政、汽车、医疗等行业。",
                        src: require("@/assets/img/datas/qy_hydz.png"),
                      },
                      {
                        name: "瑞晨环保",
                        comType: "制造业",
                        inDate: "2021年1月27日",
                        comInfo:
                          "深圳瑞晨环保科技股份有限公司是一家节能环保领域的高科技公司。公司专注于流体输送(水泵、风机)、精控燃烧、高效换热等领域的高新技术研发、节能产品设计、生产，并提供专业技术改造服务，为用户提供专业的综合节能解决方案。",
                        src: require("@/assets/img/datas/qy_rchb.png"),
                      },
                      {
                        name: "祥利科技",
                        comType: "制造业",
                        inDate: "2021年2月29日",
                        comInfo:
                          "祥利科技有限公司主要研发和生产:辐照交联低烟无卤阻燃聚烯烃、光伏用低烟无卤聚烯烃、硅烷交联低烟无卤阻燃聚烯烃、热塑性低烟无卤阻燃聚烯烃、UL标准PVC电缆料、PVC弹性体和丁腈复合物、PVC耐寒料等多个产品系列。可为电线电缆、通讯、轨道交通、船舶、汽车、风力和光伏等多个领域提供专业的改性塑料解决方案。多项产品符合ROHS、REACH、UL、FDA等相关要求。",
                        src: require("@/assets/img/datas/qy_xlkj.png"),
                      },
                    ],
                  },
                  {
                    name: "B座",
                    buildings: [
                      {
                        name: "祥利科技",
                        comType: "制造业",
                        inDate: "2021年2月29日",
                        comInfo:
                          "祥利科技有限公司主要研发和生产:辐照交联低烟无卤阻燃聚烯烃、光伏用低烟无卤聚烯烃、硅烷交联低烟无卤阻燃聚烯烃、热塑性低烟无卤阻燃聚烯烃、UL标准PVC电缆料、PVC弹性体和丁腈复合物、PVC耐寒料等多个产品系列。可为电线电缆、通讯、轨道交通、船舶、汽车、风力和光伏等多个领域提供专业的改性塑料解决方案。多项产品符合ROHS、REACH、UL、FDA等相关要求。",
                        src: require("@/assets/img/datas/qy_xlkj.png"),
                      },
                      {
                        name: "升华集团",
                        comType: "制造业",
                        inDate: "2021年4月12日",
                        comInfo:
                          "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                        src: require("@/assets/img/datas/qy_shjt.png"),
                      },
                      {
                        name: "万劲科技",
                        comType: "批发和零售业",
                        inDate: "2021年1月23日",
                        comInfo:
                          "深圳市万劲科技有限公司，于2012-04-06在中国 广东 深圳注册成立，属于批发和零售业，主营行业为批发和零售业，我公司以生产加工的模式经营，加工方式为来料加工,OEM加工,来样加工,ODM加工,来料代工加工,来图加工,其他,手工加工，加工工艺为其他照明加工工艺，服务领域为电子; 通信; 礼品工艺品; 纺织皮革; 玩具; 数码家电; 其它，员工人数101 - 200 人，注册资本50万元。深圳市万劲科技有限公司办公地址为深圳市宝安区沙井街道西环路沙一新村82号2楼201（办公场所），如果您对我们的产品、技术或服务有兴趣，随时欢迎您的来电或上门咨询。",
                        src: require("@/assets/img/datas/qy_wjkj.png"),
                      },
                      {
                        name: "鹄跃电子",
                        comType: "制造业",
                        inDate: "2021年2月34日",
                        comInfo:
                          "鹄跃电子科技（深圳）有限公司是专门从事工业自动化控制产品的研发、生产和销售的高新技术企业，主要产品包括20V~60V低压交流伺服、220V交流伺服以及配套的永磁同步电机等。服务的行业涵盖了装备制造业、节能环保、新能源三大领域，产品广泛应用于物流、机床、电线、电缆、塑胶、印刷包装、纺织化纤、建材、冶金、煤矿、市政、汽车、医疗等行业。",
                        src: require("@/assets/img/datas/qy_hydz.png"),
                      },
                    ],
                  },
                  {
                    name: "C座",
                    buildings: [
                      {
                        name: "一博科技",
                        comType: "智能硬件",
                        inDate: "2021年5月23日",
                        comInfo:
                          "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
                        src: require("@/assets/img/datas/qy_ybkj.png"),
                      },
                      {
                        name: "华夏视科集团",
                        comType: "生物科技",
                        inDate: "2021年2月02日",
                        comInfo:
                          "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
                        src: require("@/assets/img/datas/qy_hx.png"),
                      },
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                      {
                        name: "升华集团",
                        comType: "制造业",
                        inDate: "2021年4月12日",
                        comInfo:
                          "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                        src: require("@/assets/img/datas/qy_shjt.png"),
                      },
                    ],
                  },
                ],
              },
              {
                bulding: "2期",
                id: 2,
                nums: [
                  {
                    name: "A座",
                    buildings: [
                      {
                        name: "华夏视科集团",
                        comType: "生物科技",
                        inDate: "2021年2月02日",
                        comInfo:
                          "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
                        src: require("@/assets/img/datas/qy_hx.png"),
                      },
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                      {
                        name: "一博科技",
                        comType: "智能硬件",
                        inDate: "2021年5月23日",
                        comInfo:
                          "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
                        src: require("@/assets/img/datas/qy_ybkj.png"),
                      },
                      {
                        name: "升华集团",
                        comType: "制造业",
                        inDate: "2021年4月12日",
                        comInfo:
                          "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                        src: require("@/assets/img/datas/qy_shjt.png"),
                      },
                    ],
                  },
                  {
                    name: "B座",
                    buildings: [
                      {
                        name: "升华集团",
                        comType: "制造业",
                        inDate: "2021年4月12日",
                        comInfo:
                          "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                        src: require("@/assets/img/datas/qy_shjt.png"),
                      },
                      {
                        name: "一博科技",
                        comType: "智能硬件",
                        inDate: "2021年5月23日",
                        comInfo:
                          "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
                        src: require("@/assets/img/datas/qy_ybkj.png"),
                      },
                      {
                        name: "华夏视科集团",
                        comType: "生物科技",
                        inDate: "2021年2月02日",
                        comInfo:
                          "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
                        src: require("@/assets/img/datas/qy_hx.png"),
                      },
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                    ],
                  },
                  {
                    name: "C座",
                    buildings: [
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                      {
                        name: "一博科技",
                        comType: "智能硬件",
                        inDate: "2021年5月23日",
                        comInfo:
                          "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
                        src: require("@/assets/img/datas/qy_ybkj.png"),
                      },
                      {
                        name: "华夏视科集团",
                        comType: "生物科技",
                        inDate: "2021年2月02日",
                        comInfo:
                          "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
                        src: require("@/assets/img/datas/qy_hx.png"),
                      },
                      {
                        name: "升华集团",
                        comType: "制造业",
                        inDate: "2021年4月12日",
                        comInfo:
                          "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                        src: require("@/assets/img/datas/qy_shjt.png"),
                      },
                    ],
                  },
                ],
              },
              {
                bulding: "3期",
                id: 3,
                nums: [
                  {
                    name: "A座",
                    buildings: [
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                      {
                        name: "一博科技",
                        comType: "智能硬件",
                        inDate: "2021年5月23日",
                        comInfo:
                          "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
                        src: require("@/assets/img/datas/qy_ybkj.png"),
                      },
                      {
                        name: "华夏视科集团",
                        comType: "生物科技",
                        inDate: "2021年2月02日",
                        comInfo:
                          "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
                        src: require("@/assets/img/datas/qy_hx.png"),
                      },
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                    ],
                  },
                  {
                    name: "B座",
                    buildings: [
                      {
                        name: "升华集团",
                        comType: "制造业",
                        inDate: "2021年4月12日",
                        comInfo:
                          "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                        src: require("@/assets/img/datas/qy_shjt.png"),
                      },
                      {
                        name: "一博科技",
                        comType: "智能硬件",
                        inDate: "2021年5月23日",
                        comInfo:
                          "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
                        src: require("@/assets/img/datas/qy_ybkj.png"),
                      },
                      {
                        name: "华夏视科集团",
                        comType: "生物科技",
                        inDate: "2021年2月02日",
                        comInfo:
                          "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
                        src: require("@/assets/img/datas/qy_hx.png"),
                      },
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                      {
                        name: "升华集团",
                        comType: "制造业",
                        inDate: "2021年4月12日",
                        comInfo:
                          "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                        src: require("@/assets/img/datas/qy_shjt.png"),
                      },
                    ],
                  },
                  {
                    name: "C座",
                    buildings: [
                      {
                        name: "一博科技",
                        comType: "智能硬件",
                        inDate: "2021年5月23日",
                        comInfo:
                          "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
                        src: require("@/assets/img/datas/qy_ybkj.png"),
                      },
                      {
                        name: "华夏视科集团",
                        comType: "生物科技",
                        inDate: "2021年2月02日",
                        comInfo:
                          "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
                        src: require("@/assets/img/datas/qy_hx.png"),
                      },
                      {
                        name: "中国建设银行",
                        comType: "生物科技",
                        inDate: "2021年3月13日",
                        comInfo:
                          "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
                        src: require("@/assets/img/datas/qy_zgjsyh.png"),
                      },
                      {
                        name: "升华集团",
                        comType: "制造业",
                        inDate: "2021年4月12日",
                        comInfo:
                          "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                        src: require("@/assets/img/datas/qy_shjt.png"),
                      },
                    ],
                  },
                ],
              },
            ],
            companiesImgsListDatas: [
              {
                name: "万劲科技",
                comType: "批发和零售业",
                inDate: "2021年1月23日",
                comInfo:
                  "深圳市万劲科技有限公司，于2012-04-06在中国 广东 深圳注册成立，属于批发和零售业，主营行业为批发和零售业，我公司以生产加工的模式经营，加工方式为来料加工,OEM加工,来样加工,ODM加工,来料代工加工,来图加工,其他,手工加工，加工工艺为其他照明加工工艺，服务领域为电子; 通信; 礼品工艺品; 纺织皮革; 玩具; 数码家电; 其它，员工人数101 - 200 人，注册资本50万元。深圳市万劲科技有限公司办公地址为深圳市宝安区沙井街道西环路沙一新村82号2楼201（办公场所），如果您对我们的产品、技术或服务有兴趣，随时欢迎您的来电或上门咨询。",
                src: require("@/assets/img/datas/qy_wjkj.png"),
              },
              {
                name: "鹄跃电子",
                comType: "制造业",
                inDate: "2021年2月34日",
                comInfo:
                  "鹄跃电子科技（深圳）有限公司是专门从事工业自动化控制产品的研发、生产和销售的高新技术企业，主要产品包括20V~60V低压交流伺服、220V交流伺服以及配套的永磁同步电机等。服务的行业涵盖了装备制造业、节能环保、新能源三大领域，产品广泛应用于物流、机床、电线、电缆、塑胶、印刷包装、纺织化纤、建材、冶金、煤矿、市政、汽车、医疗等行业。",
                src: require("@/assets/img/datas/qy_hydz.png"),
              },
              {
                name: "瑞晨环保",
                comType: "制造业",
                inDate: "2021年1月27日",
                comInfo:
                  "深圳瑞晨环保科技股份有限公司是一家节能环保领域的高科技公司。公司专注于流体输送(水泵、风机)、精控燃烧、高效换热等领域的高新技术研发、节能产品设计、生产，并提供专业技术改造服务，为用户提供专业的综合节能解决方案。",
                src: require("@/assets/img/datas/qy_rchb.png"),
              },
              {
                name: "祥利科技",
                comType: "制造业",
                inDate: "2021年2月29日",
                comInfo:
                  "祥利科技有限公司主要研发和生产:辐照交联低烟无卤阻燃聚烯烃、光伏用低烟无卤聚烯烃、硅烷交联低烟无卤阻燃聚烯烃、热塑性低烟无卤阻燃聚烯烃、UL标准PVC电缆料、PVC弹性体和丁腈复合物、PVC耐寒料等多个产品系列。可为电线电缆、通讯、轨道交通、船舶、汽车、风力和光伏等多个领域提供专业的改性塑料解决方案。多项产品符合ROHS、REACH、UL、FDA等相关要求。",
                src: require("@/assets/img/datas/qy_xlkj.png"),
              },
              {
                name: "升华集团",
                comType: "制造业",
                inDate: "2021年4月12日",
                comInfo:
                  "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
                src: require("@/assets/img/datas/qy_shjt.png"),
              },
              {
                name: "一博科技",
                comType: "智能硬件",
                inDate: "2021年5月23日",
                comInfo:
                  "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
                src: require("@/assets/img/datas/qy_ybkj.png"),
              },
              // {
              //   name: "华夏视科集团",
              //   comType: "生物科技",
              //   inDate: "2021年2月02日",
              //   comInfo:
              //     "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
              //   src: require("@/assets/img/datas/qy_hx.png"),
              // },
              // {
              //   name: "中国建设银行",
              //   comType: "生物科技",
              //   inDate: "2021年3月13日",
              //   comInfo:
              //     "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
              //   src: require("@/assets/img/datas/qy_zgjsyh.png"),
              // },
              // {
              //   name: "升华集团",
              //   comType: "制造业",
              //   inDate: "2021年4月12日",
              //   comInfo:
              //     "升华集团是一家集智能制造、物贸流通、金融科技、矿业开发、股权投资等五大支柱型产业板块的国家级大型控股企业集团",
              //   src: require("@/assets/img/datas/qy_shjt.png"),
              // },
              // {
              //   name: "一博科技",
              //   comType: "智能硬件",
              //   inDate: "2021年5月23日",
              //   comInfo:
              //     "一博科技是一家专注于高速PCB设计、PCB制板、SMT焊接加工、元器件供应等服务的企业 ",
              //   src: require("@/assets/img/datas/qy_ybkj.png"),
              // },
              // {
              //   name: "华夏视科集团",
              //   comType: "生物科技",
              //   inDate: "2021年2月02日",
              //   comInfo:
              //     "公司于2013年05月10日成立。法定代表人魏俊华，公司经营范围包括：一般经营项目是：从事电子科技、信息科技、通信技术等领域内的技术开发、技术咨询；汽车用品、汽摩配件、电子设备及产品、计算机、软件及辅助设备、通信设备的销售；互联网技术的研发、咨询；应用软件开发；动漫动画设计；经营电子商务；从事广告业务；文化活动策划；国内贸易等。",
              //   src: require("@/assets/img/datas/qy_hx.png"),
              // },
              // {
              //   name: "中国建设银行",
              //   comType: "生物科技",
              //   inDate: "2021年3月13日",
              //   comInfo:
              //     "成立于1954年10月1日的中国人民建设银行（后于1996年3月26日正式更名为中国建设银行）。总行位于北京金融大街25号，是中央管理的大型国有银行，国家副部级单位。 中国建设银行主要经营领域包括公司银行业务、个人银行业务和资金业务，在29个国家和地区设有分支机构及子公司，拥有基金、租赁、信托、人寿、财险、投行、期货、养老金等多个行业的子公司。",
              //   src: require("@/assets/img/datas/qy_zgjsyh.png"),
              // },
            ],
          },
        },
        {
          title: "待入驻企业",
          type: "enterprisesSettled",
          datas: {
            enterprisesListDatas: [
              {
                name: "博雅",
                src: require("@/assets/img/datas/drz_by.png"),
                comInfo:
                  "博雅公司专注于储存器产品，SPI NOR FLASH自2014年以来批量应用于客户，迄今客户使用，出货量累计超10亿颗，品质稳定可靠，客户满意度优良。 产品广泛应用于各类嵌入式系统，包括消费电子，数码产品，电脑相关，网络通信等，性能参数完全兼容全球同类知名品牌SPANSION，WINBOND，MXIC，GD等，性价比优势明显。",
              },
              {
                name: "凯朗能源科技",
                src: require("@/assets/img/datas/drz_klnykj.png"),
                comInfo:
                  "凯朗能源科技公司，是一家基于合同能源管理机制运作的、以服务企业、服务社会目的的专业化能源技术服务公司。我司与能源消耗企业签订节能服务合同，向客户提供能源审计、可行性研究、节能项目规划设计、项目融资、设备和材料采购、工程施工、人员培训、节能量监测、改造系统的运行、维护和管理等服务。",
              },
              {
                name: "必智信息",
                src: require("@/assets/img/datas/drz_bzxx.png"),
                comInfo:
                  '必智信息科技基于律师行业信息化管理15年专注研究，结合现有的300多家知名律师事务所用户的管理经验，针对新的移动互联办公趋势，利用移动互联网优势、云计算以及大数据的优点设计出的一套传承经典，结合创新的云时代律师事务所核心业务协同办公平台，为未来虚拟化办公奠定坚实的基础。律师e通与传统的律师办公管理软件相比，"人为中心"，"案件为核心"的人性化一站式一体化的平台设计理念，横向解决律师执业中的各类问题，纵向满足律师事务所的管理需求，更安全、更稳定、更易用、更高效。',
              },
              {
                name: "蓝壳科技",
                src: require("@/assets/img/datas/drz_lkkj.png"),
                comInfo:
                  "蓝壳科技有限公司是一家以互联网领域O2O平台产品研发及配套服务为主，标准化管理、快速发展的高新技术企业，拥有一整套的O2O洗衣解决方案，研发出了包括有分配格架系统、掉标统计、附件管理、岗位管理等功能在内的工厂后台管理系统以及专门设计开发了整套门店使用的后台管理系统。不管是商户还是门店都有自己独立的运营管理后台，完美解决跨店消费问题，灵活管理会员、跟踪订单流程。",
              },
              {
                name: "迪海科技",
                src: require("@/assets/img/datas/drz_dhkj.png"),
                comInfo:
                  "广东迪海信息科技有限公司于2019年04月09日成立。公司经营范围包括：安防设备、计算机设备的租赁、销售；安防工程、弱电工程、网络工程、网络综合布线工程、建筑智能化工程的设计、施工；计算机信息科技领域内的技术开发、技术咨询、技术服务、技术转让；计算机系统集成；通讯设备、电子产品的销售、安装、维修；计算机软硬件、人工智能产品、机器人、教学设备的研发、销售；货物及技术的进出口业务；家用电器、办公用品、五金交电、机电设备的销售等",
              },
              {
                name: "穆嘉科技",
                src: require("@/assets/img/datas/drz_mjkj.png"),
                comInfo:
                  "穆嘉电子科技（深圳）有限公司，国内领先的IC代理分销商，致力于恩智浦（NXP）、飞思卡尔（FREESCALE）、意法半导体（ST）、美光（MICRON）、罗姆（ROHM）、瑞萨（RENESAS ）、爱特梅尔（ATMEL）等国际知名品牌的代理及应用推广，为汽车电子，仪表，安防监控，矿井安全，工业控制等终端领域厂商提供选型，方案参考，技术咨询等专业的技术服务",
              },
              //
              {
                name: "氪空间",
                src: require("@/assets/img/datas/drz_kkj.png"),
              },
              {
                name: "威信科技",
                src: require("@/assets/img/datas/drz_wxkj.png"),
              },
              {
                name: "卓然睿和自动化",
                src: require("@/assets/img/datas/drz_zr.png"),
              },
              {
                name: "EOPLE",
                src: require("@/assets/img/datas/drz_eople.png"),
              },
              {
                name: "格瑞智慧能源",
                src: require("@/assets/img/datas/drz_gr.png"),
              },
              {
                name: "思码软件",
                src: require("@/assets/img/datas/drz_smrj.png"),
              },
            ],
          },
        },
      ],
      centerDatasList: [
        {
          name: "企业总数",
          val: 2483,
        },
        {
          name: "商家总数",
          val: 196,
        },
        {
          name: "员工总数",
          val: 32856,
        },
        {
          name: "访客总数",
          val: 289,
        },
      ],
    };
  },
  components: {},
  created() {
    this.$store.commit("SET_CENTERDATAS", [true, this.centerDatasList]);
  },
  mounted() {},
  methods: {},
};
</script>

<style lang="less" scoped>
@import "~@/style/gl.less";
</style>
